# SetObjMaterialHandle

## Description
```pascal
FUNCTION SetObjMaterialHandle(
				VAR objectHandle : HANDLE;
				materialHandle   : HANDLE) : BOOLEAN;
```

```python

def vs.SetObjMaterialHandle(objectHandle, materialHandle):
    return (BOOLEAN, objectHandle)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE||
|materialHandle|HANDLE||

## Version
Availability: from Vectorworks 2021
## Category
* Object Attributes